Revit 2027 API
IConnector.Height Property
The height of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
double Height { get; }
ReadOnly Property Height As Double
	Get
property double Height {
	double get ();
}
abstract Height : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's shape is not rectangular.
Remarks
This property is used to retrieve the height of the connector.
See Also
Reference
IConnector Interface
Autodesk.Revit.DB Namespace